using Microsoft.VisualBasic;
using System.Text;

public class Client
{
    private readonly HttpClient _httpClient;


    public Client()
    {
        _httpClient = new HttpClient();
    }

    public async Task<string> Swagger(ModelSwagger model)
    {
        string zodiac = model.Zodiac;
        string request = null;
        if (zodiac == "Овен" || zodiac == "Телець" ||  zodiac == "Близнюки" ||  zodiac == "Рак" ||  zodiac == "Лев" ||  zodiac == "Діва" ||  zodiac == "Терези" ||  zodiac == "Скорпіон"  || zodiac == "Стрілець"  || zodiac == "Козеріг"  || zodiac == "Водолій" || zodiac == "Риби")
        {
            string[] first = { "Сьогодні - ідеальний день для нових починань.", "Оптимальний день для того, щоб зробити сміливий вчинок!", "Будьте обережні, сьогодні зірки можуть вплинути на ваше фінансове положення.", "Найкращий час для того, щоб почати нові відносини або розібратися зі старими.", "Продуктивний день для того, щоб розібратися зі справами, які у вас накопилися." }; string[] second = { "Але пам'ятайте, що навіть в цьому випадку слід не забувати про", "Якщо поЇдете за місто, завчасно подумайте про", "Ті, хто сьогодні націлений виконати купу справ, мають пам'ятати про", "Якщо у вас знесилення, зверніть увагу на", "Пам'ятайте, що думки матеріальні, а це означає, що вам протягом дня слід постійно думати про" };
            string[] second_add = { "відносини с друзьями и близкими.", "роботу и ділові питання, які можуть так невчасно завадити планам.", "себе и своє здоров'я, інакше до вечера можлива повна плутанина.", "побутові питання — особливо ті, які ви не закінчили вчора.", "відпочинок, щоб не перетворити себе в загнаного коня в кінці місяця." };
            string[] third = { "Пліткарі можуть говорити вам зворотне, але сьогодні їх слухати не слід.", "Знайте, що успіх приходить тільки до настриливих, тому присвятіть цей день вихованню духу.", "Навіть якщо ви не зможете зменшити вплив ретроградного Меркурія, то хоча би доведіть справи до кінця.", "Не треба боятися самотніх зустрічей — сьогодні той самий час, коли вони дуже багато значать.", "Якщо зустрінете незнайомця на шляху — проявіть ініціативу, і тоді ця зустріч принесе вам приємний клопіт." };
            Random random = new Random();
            request = $"{first[random.Next(first.Length)]} {second[random.Next(second.Length)]} {second_add[random.Next(second_add.Length)]} {third[random.Next(third.Length)]}";
        }
        else
        {
            request = "Сталася помилка або невірно введений знак зодіаку";
        }
        return (request);
    }
}